{
    "title": "2.游대Control de Flujo",
    "description": "En este m칩dulo aprender치s a controlar c칩mo se ejecuta tu programa. Usar치s condicionales para tomar decisiones, bucles para repetir acciones y operadores l칩gicos para combinar condiciones. Tambi칠n ver치s c칩mo interrumpir o continuar ciclos seg칰n la l칩gica de tu programa.",
    "steps": [
        {
            "name": "1. Condicionales: <code>if</code>, <code>elif</code>, <code>else</code>",
            "description": "En esta unidad aprender치s a permitir que tu programa tome decisiones usando <code>if</code>, <code>elif</code> y <code>else</code>, de modo que el c칩digo pueda ejecutar acciones diferentes seg칰n las condiciones que se cumplan. Ver치s c칩mo se comporta el flujo cuando una condici칩n es verdadera, qu칠 ocurre cuando ninguna coincide y c칩mo encadenar m칰ltiples opciones.",
            "color": "#FFD43B",
            "unit": "learning-unit1"
        },
        {
            "name": "2. Operadores L칩gicos y de Comparaci칩n",
            "description":"Aqu칤 entender치s c칩mo funcionan operadores como <code>==</code>, <code>!=</code>, <code><</code>, <code>></code>, <code><=</code>, <code>>=</code>, y c칩mo combinarlos con <code>and</code>, <code>or</code> y <code>not</code> para construir condiciones m치s complejas. Esto te permitir치 evaluar varias situaciones al mismo tiempo y crear decisiones m치s precisas dentro de tus estructuras condicionales.",
            "color": "#3776AB",
            "unit": "learning-unit2"
        },
        {
            "name": "3. Bucles <code>while</code> y <code>for</code>",
            "description": "En esta unidad aprender치s a repetir instrucciones usando <code>while</code> y <code>for</code>, lo que permite repetir tareas sin escribir el mismo c칩digo muchas veces. As칤 mismo, aprender치s a recorrer una secuencia de caracteres (<code>str</code>).",
            "color": "#1B983A",
            "unit": "learning-unit3"
        },
        {
            "name": "4 Control de Flujo en Bucles",
            "description": "Aqu칤 descubrir치s c칩mo modificar la ejecuci칩n interna de un bucle usando instrucciones especiales como <code>break</code> para detenerlo antes de tiempo, <code>continue</code> para saltar una repetici칩n espec칤fica y <code>pass</code> para dejar un bloque vac칤o que completar치s m치s adelante. Estas herramientas te permiten tener un control m치s preciso y flexible sobre el comportamiento de tus ciclos.",
            "color": "#6464FF",
            "unit": "learning-unit4"
        }
    ]
}
