{
  "title": "Python Ruta de Aprendizaje",
  "description": "Emb치rcate en el camino para convertirte en un Pro游땙 de Python desde cero.",
  "steps": [
    {
      "name": "1.游빌Fundamentos del Lenguaje",
      "description": "En este m칩dulo aprender치s qu칠 es Python y c칩mo crear tus primeros programas. Conocer치s c칩mo mostrar texto, usar variables, trabajar con n칰meros y cadenas, realizar operaciones b치sicas e interactuar con el usuario mediante entradas de datos.",
      "color": "#FFD43B",
      "module": "module1"
    },
    {
      "name": "2.游대Control de Flujo",
      "description": "En este m칩dulo aprender치s a controlar c칩mo se ejecuta tu programa. Usar치s condicionales para tomar decisiones, bucles para repetir acciones y operadores l칩gicos para combinar condiciones. Tambi칠n ver치s c칩mo interrumpir o continuar ciclos seg칰n la l칩gica de tu programa.",
      "color": "#3776AB",
      "module": "module2"
    },
    {
      "name": "3.游닍Estructuras de Datos",
      "description": "En este m칩dulo aprender치s a manejar distintos tipos de colecciones en Python. Conocer치s c칩mo usar listas, tuplas, diccionarios y conjuntos para almacenar y organizar informaci칩n, adem치s de recorrer y manipular sus elementos.",
      "color": "#1B983A",
      "module" : "module3"
    },
    {
      "name": "4.丘뙖잺Funciones y Reutilizaci칩n de C칩digo",
      "description": "En este m칩dulo aprender치s a crear y usar funciones para organizar tu c칩digo y evitar repeticiones. Ver치s c칩mo pasar y devolver valores, usar par치metros opcionales y entender el alcance de las variables. Tambi칠n conocer치s las funciones anidadas y las expresiones lambda.",
      "color": "#6464FF",
      "module": "module4"
    },
    {
      "name": "5.游늭Manejo de Texto y Datos",
      "description": "En este m칩dulo aprender치s a trabajar con cadenas de texto, modificarlas y formatearlas usando distintas t칠cnicas. Tambi칠n ver치s c칩mo convertir texto en listas y viceversa, y aplicar치s lo aprendido en peque침os proyectos pr치cticos como un contador de palabras o un verificador de contrase침as.",
      "color": "#FFD43B",
      "module": "module5"
    },
    {
      "name": "6.游빔Pensamiento L칩gico y Funciones Avanzadas",
      "description": "En este m칩dulo desarrollar치s tu l칩gica de programaci칩n aprendiendo t칠cnicas m치s avanzadas. Ver치s c칩mo usar funciones recursivas, comprensiones de listas y funciones integradas de Python para resolver problemas de forma m치s eficiente. Tambi칠n aprender치s a tratar las funciones como objetos para crear c칩digo m치s flexible..",
      "color": "#3776AB",
      "module": "module6"
    },
    {
      "name": "7.丘멆잺Manejo de Errores y Excepciones",
      "description": "En este m칩dulo aprender치s a identificar los errores m치s comunes en Python y a controlarlos mediante excepciones. Usar치s bloques <code>try</code>, <code>except</code>, <code>finally</code> y <code>else</code> para manejar fallos de forma segura y mantener tus programas funcionando correctamente.",
      "color": "#1B983A",
      "module": "module7"
    }
  ]
}
